"use client";

import Image from "next/image";

export default function HowWeWorkPageArabic() {
    return (
        <section className="bg-[#F8F8F8] py-20 font-poppins">
            <div className="text-center mb-10">
                <h2 className="text-[#002B5B] text_heading text-2xl sm:text-3xl md:text-4xl lg:text-[48px] font-[584] leading-[130%]">كيف نعمل</h2>
            </div>
            <div className="max-w-7xl mx-auto px-4 flex flex-col lg:flex-row gap-12 items-center">
                {/* Left: Steps */}
                <div className="relative w-full lg:w-1/2">
                    {/* Steps */}
                    <div className="space-y-10 pl-12 relative z-10">
                        {/* Step 1 */}
                        <div className="flex justify-end gap-4 ">

                            <div className="text-end">
                                <h3 className="text-[#002B5B] text_heading text-lg sm:text-xl md:text-[24px] font-[584] leading-[130%]">اكتشاف العميل</h3>
                                <p dir="rtl" className="text-[#070707] font-poppins text-base sm:text-lg md:text-[20px] font-normal leading-[160%] tracking-[0.1px]">
                                    نقوم بجمع المعلومات ذات الصلة حول عملك وأهدافك واحتياجات السوق.
                                </p>
                            </div>
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48" fill="none">
                                <rect width="48" height="48" rx="24" fill="#002B5B" />
                                <path d="M25.42 30.88L23.78 31.08C23.78 30.92 23.76 30.5667 23.72 30.02C23.6933 29.4733 23.6467 28.8 23.58 28C23.5133 27.2 23.4267 26.3333 23.32 25.4C23.2267 24.4667 23.1133 23.5267 22.98 22.58C22.86 21.6333 22.72 20.7467 22.56 19.92C22.4 19.0933 22.22 18.3933 22.02 17.82L23.6 17.38C23.8533 18.1533 24.08 19.0533 24.28 20.08C24.48 21.0933 24.6467 22.1467 24.78 23.24C24.9267 24.3333 25.04 25.3933 25.12 26.42C25.2133 27.4333 25.28 28.3333 25.32 29.12C25.3733 29.9067 25.4067 30.4933 25.42 30.88Z" fill="white" />
                            </svg>
                        </div>
                        {/* Step 2 */}
                        <div className="flex gap-4 justify-end ">
                            <div className="text-end">
                                <h3 className="text-[#002B5B] text_heading text-lg sm:text-xl md:text-[24px] font-[584] leading-[130%]">أبحاث السوق السعودية</h3>
                                <p dir="rtl" className="text-[#070707] font-poppins text-base sm:text-lg md:text-[20px] font-normal leading-[160%] tracking-[0.1px]">
                                    يقوم فريقنا بإجراء تحليل عميق لتقييم الفرصة والجدوى والمنافسة.
                                </p>
                            </div>
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48" fill="none">
                                <rect width="48" height="48" rx="24" fill="#002B5B" />
                                <path d="M23.42 30.88L21.78 31.08C21.78 30.92 21.76 30.5667 21.72 30.02C21.6933 29.4733 21.6467 28.8 21.58 28C21.5133 27.2 21.4267 26.3333 21.32 25.4C21.2267 24.4667 21.1133 23.5267 20.98 22.58C20.86 21.6333 20.72 20.7467 20.56 19.92C20.4 19.0933 20.22 18.3933 20.02 17.82L21.6 17.38C21.8533 18.1533 22.08 19.0533 22.28 20.08C22.48 21.0933 22.6467 22.1467 22.78 23.24C22.9267 24.3333 23.04 25.3933 23.12 26.42C23.2133 27.4333 23.28 28.3333 23.32 29.12C23.3733 29.9067 23.4067 30.4933 23.42 30.88ZM24.24 21.58C23.5733 21.58 22.98 21.5 22.46 21.34C21.9533 21.18 21.5333 20.98 21.2 20.74V19.08C21.5733 19.3733 22.0267 19.5933 22.56 19.74C23.0933 19.8867 23.6267 19.96 24.16 19.96C24.4933 19.96 24.8 19.94 25.08 19.9C25.3733 19.86 25.6333 19.76 25.86 19.6C26.0867 19.44 26.2733 19.1933 26.42 18.86C26.58 18.5133 26.7 18.04 26.78 17.44L28.14 17.7C28.0733 18.7133 27.86 19.5 27.5 20.06C27.14 20.62 26.68 21.0133 26.12 21.24C25.56 21.4667 24.9333 21.58 24.24 21.58Z" fill="white" />
                            </svg>
                        </div>

                        {/* Step 3 */}
                        <div className="flex justify-end gap-4">
                            <div className="text-end">
                                <h3 className="text-[#002B5B] text_heading text-lg sm:text-xl md:text-[24px] font-[584] leading-[130%]">التطوير الاستراتيجي</h3>
                                <p dir="rtl" className="text-[#070707] font-poppins text-base sm:text-lg md:text-[20px] font-normal leading-[160%] tracking-[0.1px]">
                                    نقوم بتطوير خطة عمل مخصصة وننفذها بمرونة وامتثال.
                                </p>
                            </div>
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48" fill="none">
                                <rect width="48" height="48" rx="24" fill="#002B5B" />
                                <path d="M22.42 30.88L20.78 31.08C20.78 30.92 20.76 30.5667 20.72 30.02C20.6933 29.4733 20.6467 28.8 20.58 28C20.5133 27.2 20.4267 26.3333 20.32 25.4C20.2267 24.4667 20.1133 23.5267 19.98 22.58C19.86 21.6333 19.72 20.7467 19.56 19.92C19.4 19.0933 19.22 18.3933 19.02 17.82L20.6 17.38C20.8533 18.1533 21.08 19.0533 21.28 20.08C21.48 21.0933 21.6467 22.1467 21.78 23.24C21.9267 24.3333 22.04 25.3933 22.12 26.42C22.2133 27.4333 22.28 28.3333 22.32 29.12C22.3733 29.9067 22.4067 30.4933 22.42 30.88ZM22.82 22.46C22.38 22.46 22.02 22.3733 21.74 22.2C21.4733 22.0267 21.2667 21.82 21.12 21.58C20.9867 21.3267 20.9 21.1 20.86 20.9L20.76 18.02L21.3 20.04C21.3667 20.2533 21.4733 20.4267 21.62 20.56C21.78 20.68 21.9467 20.7667 22.12 20.82C22.3067 20.8733 22.46 20.9 22.58 20.9C22.8067 20.9 23.0133 20.82 23.2 20.66C23.4 20.5 23.5733 20.2067 23.72 19.78C23.8667 19.34 23.9867 18.7133 24.08 17.9L25.48 18.08C25.4533 18.32 25.4133 18.58 25.36 18.86C25.3067 19.1267 25.26 19.3667 25.22 19.58C25.1933 19.7933 25.18 19.9467 25.18 20.04C25.18 20.28 25.28 20.4733 25.48 20.62C25.68 20.7533 25.9667 20.82 26.34 20.82C26.66 20.82 26.9067 20.7733 27.08 20.68C27.2533 20.5733 27.3733 20.44 27.44 20.28C27.52 20.12 27.56 19.94 27.56 19.74C27.56 19.4333 27.4933 19.1067 27.36 18.76C27.24 18.4 27.1267 18.0933 27.02 17.84L28.38 17.34C28.6333 17.8733 28.8067 18.3667 28.9 18.82C29.0067 19.2733 29.06 19.6533 29.06 19.96C29.06 20.4533 28.9467 20.8867 28.72 21.26C28.5067 21.62 28.1933 21.9 27.78 22.1C27.38 22.2867 26.9 22.38 26.34 22.38C25.7933 22.38 25.34 22.2733 24.98 22.06C24.6333 21.8333 24.4133 21.5133 24.32 21.1H24.78C24.62 21.54 24.36 21.88 24 22.12C23.64 22.3467 23.2467 22.46 22.82 22.46Z" fill="white" />
                            </svg>
                        </div>
                        {/* Reporting */}
                        <div className="pr-12 ">
                            <p dir="rtl" className="text-[15px] text-right text-gray-700 leading-relaxed">
                                <span className="text-[#070707] font-poppins text-base sm:text-lg md:text-[20px] font-normal leading-[160%] tracking-[0.1px]">التقارير: يتم تصميم التواصل بما يتناسب مع مرحلة مشاركتك - تحديثات يومية أو أسبوعية أو شهرية حسب الحاجة.</span>
                            </p>
                        </div>
                    </div>
                </div>

                {/* Right: Image */}
                <div className="w-full lg:w-1/2">
                    <Image
                        src="/how-we-work.png"
                        alt="How We Work"
                        width={700}
                        height={500}
                        className="rounded-lg w-full h-auto object-cover"
                    />
                </div>
            </div>
        </section>
    );
}
